- Data Visualisation is a small part of the overall EDA process

- EDA = Exploratory Data Analysis

- Data Anlysts --->
    - tools like Power BI
    - Tableau
    - Large volumes of data - large quantity 
        -300 rows is not large
        10k around data fair amount of data
        400k rows of data

- To be able to find data - data sources
- Import that data into your python files (1)
- should be able to analyse it (2)
    - by using visualization tools we learnt
    -matplotlib and seaborn

1. Find data related to the titanic ship
    -download and  import to nbs
    -make some visualisations
    -and finally, write 4 lines about the data (give some information about the data that is not easily observable-make some judgement/inferences)

In [2]:
import seaborn as sns

In [4]:
titanic = sns.load_dataset("titanic")
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [6]:
titanic=titanic.dropna()

In [7]:
titanic['age'] = titanic['age'].astype(int)
titanic

C:\Users\NEC\AppData\Local\Temp\ipykernel_16056\1824805563.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  titanic['age'] = titanic['age'].astype(int)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33,0,0,5.0000,S,First,man,True,B,Southampton,no,True
879,1,1,female,56,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [8]:
titanic['fare'] = titanic['fare'].round(2)
titanic

C:\Users\NEC\AppData\Local\Temp\ipykernel_16056\4195265605.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  titanic['fare'] = titanic['fare'].round(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38,1,0,71.28,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35,1,0,53.10,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54,0,0,51.86,S,First,man,True,E,Southampton,no,True
10,1,3,female,4,1,1,16.70,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58,0,0,26.55,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47,1,1,52.55,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33,0,0,5.00,S,First,man,True,B,Southampton,no,True
879,1,1,female,56,0,1,83.16,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True

1.Ticket fare does not represent an individual's payment, maybe the total cost for a group or family

2.Women were much more likely to survive than men. The rule to save "women and children first" is conducted.

3.Wealthier passengers had the best chance of survival. People in first class were more likely to get on a lifeboat than those in second or third class.

4. Young children survived more than adults. Very young babies had the best chance of being saved.

- Finding the data (first challenge!!!!)

### Data Sources

- **Primary**
    -data that we collect ourselves
    -problem - people you meet?
    -sensor data
        -sensors sense environment data -
            - proximity sensors - if you are close to the door
            -temperature sensor

    -you have to invest time, effort into this
    -need infrastructure
    -even money
    -researchers, people who have some incentive like

- **Secondary** - Rely on this a lot
    - data that you get from someone else
    - computer, looking for data and you download it


    - Kaggle
    - Gov datasets
    - github
    - uci

**What the problem is:**
Public Transport Usage or Bus Arrival Times
**Who the solution is for:**
Bus users, transportation companies,students, office workers
**Where is the problem occuring:**
Bus routes in major Malaysian cities
**Why is it worth solving**
Helps reduce waiting time and improves commuter planning

In [17]:
import numpy as np

In [18]:
import pandas as pd

In [21]:
ptm = pd.read_csv('ridership_headline.csv')
ptm

,date,bus_rkl,bus_rkn,bus_rpn,rail_lrt_ampang,rail_mrt_kajang,rail_lrt_kj,rail_monorail,rail_mrt_pjy,rail_ets,rail_intercity,rail_komuter_utara,rail_tebrau,rail_komuter
0,2019-01-01,NaN,NaN,NaN,113357,114173,139634,35804,NaN,NaN,NaN,NaN,NaN,NaN
1,2019-01-02,NaN,NaN,NaN,182715,169316,274224,31859,NaN,NaN,NaN,NaN,NaN,NaN
2,2019-01-03,NaN,NaN,NaN,187904,175304,286469,31893,NaN,NaN,NaN,NaN,NaN,NaN
3,2019-01-04,NaN,NaN,NaN,198420,187891,304755,34121,NaN,NaN,NaN,NaN,NaN,NaN
4,2019-01-05,NaN,NaN,NaN,120773,112660,145036,29950,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2491,2025-10-27,217637.0,2197.0,49849.0,188362,231694,239243,52155,102686.0,10911.0,3012.0,14783.0,8072.0,26992.0
2492,2025-10-28,226834.0,2191.0,50391.0,191938,246254,236369,50478,145679.0,9319.0,2756.0,13030.0,8102.0,25535.0
2493,2025-10-29,246232.0,2020.0,49316.0,218432,285680,289345,59506,177986.0,9064.0,2281.0,12713.0,8025.0,28387.0
2494,2025-10-30,243114.0,2092.0,46269.0,217969,285702,290912,59012,180757.0,10331.0,4181.0,16771.0,8051.0,29029.0
2495,2025-10-31,239690.0,2191.0,51477.0,225355,291628,284278,62927,179453.0,12280.0,4374.0,20177.0,9485.0,31787.0

In [ ]:
ptm=ptm.dropna()
ptm

,date,bus_rkl,bus_rkn,bus_rpn,rail_lrt_ampang,rail_mrt_kajang,rail_lrt_kj,rail_monorail,rail_mrt_pjy,rail_ets,rail_intercity,rail_komuter_utara,rail_tebrau,rail_komuter
1713,2023-09-10,142452.0,2582.0,39384.0,105562,136816,130885,48423,60038.0,11925.0,4407.0,12539.0,7607.0,14090.0
1714,2023-09-11,205586.0,2800.0,39507.0,157865,207620,237034,51266,114692.0,10570.0,2582.0,9455.0,8598.0,3289.0
1715,2023-09-12,213383.0,2617.0,40971.0,162603,219123,253835,53050,121407.0,8035.0,2354.0,8472.0,8479.0,2979.0
1716,2023-09-13,213494.0,2779.0,40401.0,164264,221451,259750,53462,122603.0,9064.0,2240.0,8580.0,8463.0,3235.0
1717,2023-09-14,208610.0,2727.0,39361.0,161769,216144,255083,53424,119665.0,10824.0,4070.0,11415.0,9011.0,3751.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2491,2025-10-27,217637.0,2197.0,49849.0,188362,231694,239243,52155,102686.0,10911.0,3012.0,14783.0,8072.0,26992.0
2492,2025-10-28,226834.0,2191.0,50391.0,191938,246254,236369,50478,145679.0,9319.0,2756.0,13030.0,8102.0,25535.0
2493,2025-10-29,246232.0,2020.0,49316.0,218432,285680,289345,59506,177986.0,9064.0,2281.0,12713.0,8025.0,28387.0
2494,2025-10-30,243114.0,2092.0,46269.0,217969,285702,290912,59012,180757.0,10331.0,4181.0,16771.0,8051.0,29029.0
2495,2025-10-31,239690.0,2191.0,51477.0,225355,291628,284278,62927,179453.0,12280.0,4374.0,20177.0,9485.0,31787.0

In [23]:
ptm.shape

(783, 14)

In [17]:
import pandas as pd

df = pd.read_csv('iris.csv')
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [19]:
df = df.rename(columns={'sepal_length':'d','sepal_width':'d1','petal_length':'f','petal_width':'f1','species':'a'})
df.head()

     d   d1    f   f1       a
0  5.1  3.5  1.4  0.2  setosa
1  4.9  3.0  1.4  0.2  setosa
2  4.7  3.2  1.3  0.2  setosa
3  4.6  3.1  1.5  0.2  setosa
4  5.0  3.6  1.4  0.2  setosa

In [ ]:
#  This is how you target a row
df.loc[1] # row

df['a'][8] # goes first to column, row

df

df['a'] # direct access to column

d        4.9
d1       3.0
f        1.4
f1       0.2
a     setosa
Name: 1, dtype: object

In [22]:
df.head(2)

     d   d1    f   f1       a
0  5.1  3.5  1.4  0.2  setosa
1  4.9  3.0  1.4  0.2  setosa

In [23]:
columns = ['p_len','p_wid','s_len','s_wid','species']

iris = pd.read_csv('iris.csv', header = None, skiprows=1, names= columns)
iris.head(2)

   p_len  p_wid  s_len  s_wid species
0    5.1    3.5    1.4    0.2  setosa
1    4.9    3.0    1.4    0.2  setosa

In [24]:
iris.shape

(150, 5)